Дошкольное_учреждение83/src/Documents/удуУвольнениеИзОрганизаций/удуУвольнениеИзОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуУвольнениеИзОрганизаций</name>
  <registerRecords>AccumulationRegister.удуЗанятыеШтатныеЕдиницыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.удуФактическиеОтпускаОрганизаций</registerRecords>
  <registerRecords>InformationRegister.удуРаботникиОрганизаций</registerRecords>
  <registerRecords>InformationRegister.удуПериодыРаботыРаботниковОрганизацийПоСовместительству</registerRecords>
  <registerRecords>InformationRegister.удуПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.удуПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиОрганизации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.удуСотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяТКРФ</name>
      <type>
        <types>CatalogRef.удуОснованияУвольненияИзОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеУвольнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийГодС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочийГодПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейЧасовКомпенсацииУдержанияОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакКомпенсацииОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокРасчетаОтпуска</name>
      <type>
        <types>EnumRef.удуПорядокРасчетаОтпуска</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуРаботникиОрганизаций/удуРаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуРаботникиОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.удуПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуПлановыеНачисленияРаботниковОрганизаций/удуПлановыеНачисленияРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуПлановыеНачисленияРаботниковОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РазмерУдалить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.удуВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуДополнительныеНачисленияОрганизаций</types>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.удуДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетаИзмерение</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуДополнительныеНачисленияОрганизаций</types>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/AccumulationRegisters/удуЗанятыеШтатныеЕдиницыОрганизаций/удуЗанятыеШтатныеЕдиницыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуЗанятыеШтатныеЕдиницыОрганизаций</name>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы/удуПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуПериодыРаботыРаботниковОрганизацийПоСовместительству/удуПериодыРаботыРаботниковОрганизацийПоСовместительству.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуПериодыРаботыРаботниковОрганизацийПоСовместительству</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуВидыДействияСНачислением/удуВидыДействияСНачислением.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыДействияСНачислением</name>
  <enumValues>
    <name>Начать</name>
  </enumValues>
  <enumValues>
    <name>Изменить</name>
  </enumValues>
  <enumValues>
    <name>НеИзменять</name>
  </enumValues>
  <enumValues>
    <name>Прекратить</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуПричиныИзмененияСостояния/удуПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуПричиныИзмененияСостояния</name>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуВидыЗанятостиВОрганизации/удуВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыЗанятостиВОрганизации</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуВидыДоговоровСФизЛицами/удуВидыДоговоровСФизЛицами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыДоговоровСФизЛицами</name>
  <enumValues>
    <name>ТрудовойДоговор</name>
  </enumValues>
  <enumValues>
    <name>Подряда</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуУвольнениеИзОрганизаций/ObjectModule.bsl
// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УвольнениеИзОрганизаций.Дата,
	|	УвольнениеИзОрганизаций.Организация,
	|	УвольнениеИзОрганизаций.Ссылка
	|ИЗ
	|	Документ.удуУвольнениеИзОрганизаций КАК УвольнениеИзОрганизаций
	|ГДЕ
	|	УвольнениеИзОрганизаций.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УвольнениеИзОрганизаций.Ссылка,
		|	УвольнениеИзОрганизаций.НомерСтроки,
		|	УвольнениеИзОрганизаций.Сотрудник,
		|	УвольнениеИзОрганизаций.Физлицо,
		|	УвольнениеИзОрганизаций.ДатаУвольнения,
		|	УвольнениеИзОрганизаций.СтатьяТКРФ,
		|	УвольнениеИзОрганизаций.ОснованиеУвольнения
		|ПОМЕСТИТЬ ВТСтрокиДокумента
		|ИЗ
		|	Документ.удуУвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизаций
		|ГДЕ
		|	УвольнениеИзОрганизаций.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	удуРаботникиОрганизаций.Период,
		|	удуРаботникиОрганизаций.Сотрудник,
		|	удуРаботникиОрганизаций.Регистратор
		|ПОМЕСТИТЬ ВТКонфликтныеДвижения
		|ИЗ
		|	РегистрСведений.удуРаботникиОрганизаций КАК удуРаботникиОрганизаций
		|ГДЕ
		|	удуРаботникиОрганизаций.Организация = &Организация
		|	И удуРаботникиОрганизаций.Сотрудник В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТЧРаботникиОрганизации.Сотрудник
		|			ИЗ
		|				ВТСтрокиДокумента КАК ТЧРаботникиОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыНачислений.Сотрудник КАК Сотрудник,
		|	НачисленияРаботниковОрганизации.ВидРасчетаИзмерение КАК ВидРасчетаИзмерение,
		|	НачисленияРаботниковОрганизации.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ ВТПлановыеНачисления
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.Сотрудник КАК Сотрудник,
		|		НачисленияРаботниковОрганизации.ВидРасчетаИзмерение КАК ВидРасчетаИзмерение,
		|		МАКСИМУМ(НачисленияРаботниковОрганизации.Период) КАК ДатаИзмененияРеквизитов
		|	ИЗ
		|		ВТСтрокиДокумента КАК Док
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.удуПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|			ПО Док.ДатаУвольнения >= НачисленияРаботниковОрганизации.Период
		|				И Док.Сотрудник = НачисленияРаботниковОрганизации.Сотрудник
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НачисленияРаботниковОрганизации.ВидРасчетаИзмерение,
		|		Док.Сотрудник) КАК ДатыНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.удуПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|		ПО ДатыНачислений.ДатаИзмененияРеквизитов = НачисленияРаботниковОрганизации.Период
		|			И ДатыНачислений.ВидРасчетаИзмерение = НачисленияРаботниковОрганизации.ВидРасчетаИзмерение
		|			И (НачисленияРаботниковОрганизации.Действие <> ЗНАЧЕНИЕ(Перечисление.удуВидыДействияСНачислением.Прекратить))
		|			И ДатыНачислений.Сотрудник = НачисленияРаботниковОрганизации.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
		|	ВТСтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|	ВТСтрокиДокумента.Сотрудник КАК Сотрудник,
		|	ВТСтрокиДокумента.Сотрудник.Наименование,
		|	ВТСтрокиДокумента.ДатаУвольнения КАК ДатаУвольнения,
		|	ВТСтрокиДокумента.СтатьяТКРФ КАК СтатьяТКРФ,
		|	ВЫРАЗИТЬ(ВТСтрокиДокумента.ОснованиеУвольнения КАК СТРОКА(300)) КАК ОснованиеУвольнения,
		|	ВТСтрокиДокумента.Ссылка.Организация КАК ОрганизацияПодразделения,
		|	ВЫБОР
		|		КОГДА ВТСтрокиДокумента.Сотрудник.Организация = &Организация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ДанныеПоРаботникуДоНазначения.ПричинаИзмененияСостояния КАК ПрежняяПричина,
		|	ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПрежнееПодразделение,
		|	ДанныеПоРаботникуДоНазначения.Должность КАК ПрежняяДолжность,
		|	ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ПрежняяСтавка,
		|	ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ПрежнийГрафикРаботы,
		|	ДанныеПоРаботникуДоНазначения.Период КАК ДатаПоследнегоДвиженияПоРаботнику,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	NULL КАК ВидРасчетаИзмерение,
		|	NULL КАК ВидРасчета,
		|	NULL КАК КонфликтныйДокумент,
		|	ВТСтрокиДокумента.Физлицо
		|ИЗ
		|	ВТСтрокиДокумента КАК ВТСтрокиДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПоследнихДвиженийРаботников.НомерСтроки КАК НомерСтроки,
		|			ДатыПоследнихДвиженийРаботников.Период КАК Период,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ДанныеПоРаботникуДоНазначения.Должность КАК Должность,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ГрафикРаботы,
		|			ДанныеПоРаботникуДоНазначения.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния,
		|			ДатыПоследнихДвиженийРаботников.Сотрудник КАК Сотрудник
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ВТСтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(Работники.Период) КАК Период,
		|				ВТСтрокиДокумента.Сотрудник КАК Сотрудник
		|			ИЗ
		|				РегистрСведений.удуРаботникиОрганизаций КАК Работники
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтрокиДокумента КАК ВТСтрокиДокумента
		|					ПО Работники.Период <= ВТСтрокиДокумента.ДатаУвольнения
		|						И (ВТСтрокиДокумента.Сотрудник = Работники.Сотрудник)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ВТСтрокиДокумента.Сотрудник,
		|				ВТСтрокиДокумента.НомерСтроки) КАК ДатыПоследнихДвиженийРаботников
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.удуРаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
		|				ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
		|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник) КАК ДанныеПоРаботникуДоНазначения
		|		ПО ВТСтрокиДокумента.НомерСтроки = ДанныеПоРаботникуДоНазначения.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТСтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ВТСтрокиДокумента1.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			ВТСтрокиДокумента КАК ВТСтрокиДокумента
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтрокиДокумента КАК ВТСтрокиДокумента1
		|				ПО ВТСтрокиДокумента.НомерСтроки < ВТСтрокиДокумента1.НомерСтроки
		|					И ВТСтрокиДокумента.Сотрудник = ВТСтрокиДокумента1.Сотрудник
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТСтрокиДокумента.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ВТСтрокиДокумента.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""НачисленияРаботникаОрганизации"",
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Наименование,
		|	ТЧРаботникиОрганизации.ДатаУвольнения,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	СписокВидовРасчета.ВидРасчетаИзмерение,
		|	СписокВидовРасчета.ВидРасчета,
		|	NULL,
		|	ТЧРаботникиОрганизации.Физлицо
		|ИЗ
		|	ВТСтрокиДокумента КАК ТЧРаботникиОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлановыеНачисления КАК СписокВидовРасчета
		|		ПО ТЧРаботникиОрганизации.Сотрудник = СписокВидовРасчета.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""КонфликтныйДокумент"",
		|	ВТСтрокиДокумента.НомерСтроки,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТКонфликтныеДвижения.Регистратор,
		|	NULL
		|ИЗ
		|	ВТСтрокиДокумента КАК ВТСтрокиДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонфликтныеДвижения КАК ВТКонфликтныеДвижения
		|		ПО (ВТКонфликтныеДвижения.Период = ВЫБОР
		|				КОГДА ВТСтрокиДокумента.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТСтрокиДокумента.ДатаУвольнения, ДЕНЬ, 1)
		|			КОНЕЦ)
		|			И ВТСтрокиДокумента.Сотрудник = ВТКонфликтныеДвижения.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = Заголовок+Символы.ВК+ "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Сотрудники"": ";

	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда

		// Сотрудник
		НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
		Если НетСотрудника Тогда
			Отказ=Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
		// ДатаУвольнения
		НетДатыУвольнения = Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаУвольнения);
		Если НетДатыУвольнения Тогда
			Отказ=Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + "не указана дата увольнения!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;

		// Организация сотрудника должна совпадать с организацией в документе
		Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
			Отказ=Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!";
			СообщениеПользователю.Сообщить();
	 	КонецЕсли;

		Если НетСотрудника ИЛИ НетДатыУвольнения Тогда
			Возврат; // Дальше не проверяем
		КонецЕсли;

		// Проверка: ранее работник должен быть принят на работу
		Если ВыборкаПоСтрокамДокумента.ПрежняяПричина = NULL Тогда
			Отказ=Истина;
			СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаУвольнения, "ДЛФ=DD") + " сотрудник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " еще не принят на работу!";
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке;
			СообщениеПользователю.Сообщить();
		ИначеЕсли ВыборкаПоСтрокамДокумента.ПрежняяПричина = Перечисления.удуПричиныИзмененияСостояния.Увольнение Тогда	
			Отказ=Истина;
			СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаУвольнения, "ДЛФ=DD") + " сотрудник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " уже уволен (с " + Формат(ВыборкаПоСтрокамДокумента.ДатаПоследнегоДвиженияПоРаботнику, "ДЛФ=DD") + ")!";
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке;
			СообщениеПользователю.Сообщить();
		КонецЕсли;

		// Проверка: противоречие другой строке документа
		Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
			Отказ=Истина;
			СтрокаСообщениеОбОшибке = "сотрудник не может быть указан в документе дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + "!"; 
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке;
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "КонфликтныйДокумент" Тогда	
        Отказ=Истина;
		// противоречие другим кадровым приказам
		СтрокаСообщениеОбОшибке = "возникает противоречие кадровому приказу " + Символы.ПС + Символы.Таб + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст=СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке;
		СообщениеПользователю.Сообщить();
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента,ВыборкаПоСтрокамДокумента, СтруктураПараметров = "")
	
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		ПрежняяСтавка			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
		ПрежнееПодразделение	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение;
		ПрежняяДолжность		= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
			
			Движение = Движения.удуЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
			
			// Свойства
			Движение.Период							= ВыборкаПоСтрокамДокумента.ДатаУвольнения+86400;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			
			// Измерения
			Движение.ПодразделениеОрганизации		= ПрежнееПодразделение;
			Движение.Должность						= ПрежняяДолжность;
			
			// Ресурсы
			Движение.КоличествоСтавок				= ПрежняяСтавка;
			
			// Реквизиты
			Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента,    ВыборкаПоРаботникиОрганизации, СтруктураПараметров = "")
	
	Если ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		// отразим новое место работы
		Движение = Движения.удуРаботникиОрганизаций.Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + 86400;
		
		// Измерения
		Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		
		// Ресурсы
		Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПрежнееПодразделение;
		Движение.Должность					= ВыборкаПоРаботникиОрганизации.ПрежняяДолжность;
		Движение.ЗанимаемыхСтавок			= ВыборкаПоРаботникиОрганизации.ПрежняяСтавка;
		Движение.ГрафикРаботы				= ВыборкаПоРаботникиОрганизации.ПрежнийГрафикРаботы;
		Движение.ПричинаИзмененияСостояния	= Перечисления.удуПричиныИзмененияСостояния.Увольнение;
		
		// Реквизиты
		Движение.ПервичныйДокумент			= ВыборкаПоШапкеДокумента.Ссылка;
		
		// Движения по регистру ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы";
		
		Если ВыборкаПоРаботникиОрганизации.Сотрудник.ВидЗанятости = Перечисления.удуВидыЗанятостиВОрганизации.ОсновноеМестоРаботы Тогда
			Движение = Движения.удуПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы.Добавить();
			
			// Измерения
			Движение.Физлицо		= ВыборкаПоРаботникиОрганизации.Физлицо;
			Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + 86400;
		КонецЕсли;
		
		// Движения по регистру "ПериодыРаботыРаботниковОрганизацийПоСовместительству"
		
		Если ВыборкаПоРаботникиОрганизации.Сотрудник.ВидЗанятости = Перечисления.удуВидыЗанятостиВОрганизации.Совместительство Тогда
			Движение = Движения.удуПериодыРаботыРаботниковОрганизацийПоСовместительству.Добавить();
			
			// Измерения
			Движение.Физлицо		= ВыборкаПоРаботникиОрганизации.Физлицо;
			Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
			Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + 86400;
		КонецЕсли;

	ИначеЕсли ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "НачисленияРаботникаОрганизации" Тогда	
		// Движения по регистру "Плановые начисления сотрудников организаций"
		Движение = Движения.удуПлановыеНачисленияРаботниковОрганизаций.Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + 86400;
		
		// Измерения
		Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидРасчетаИзмерение        = ВыборкаПоРаботникиОрганизации.ВидРасчетаИзмерение;
		
		// Ресурсы
		Движение.Показатель1				= 0;
		Движение.ВидРасчета			        = ВыборкаПоРаботникиОрганизации.ВидРасчета;
		Движение.Действие			        = Перечисления.удуВидыДействияСНачислением.Прекратить;
		
		// Реквизиты
		Движение.ПервичныйДокумент			= ВыборкаПоШапкеДокумента.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()






Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = удуОбщегоНазначенияСервер.ПредставлениеДокументаПриПроведении(Ссылка);
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
			Отказ=Истина;	
			ТекстСообщения ="Не указана организация!"; 	
			ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст=ТекстСообщения;
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
		Если НЕ Отказ Тогда

		    ВыборкаСтрокЗапроса = СформироватьЗапросПоРаботникиОрганизации().Выбрать();
			
			// для проверки числа ставок
			// обходим строки запроса, проверяем данные и формируем движения
			Пока ВыборкаСтрокЗапроса.Следующий() Цикл

				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса , Отказ, Заголовок);
				Если НЕ Отказ Тогда
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса);
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса);
				КонецЕсли;
			КонецЦикла;
 		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	удуОбщегоНазначенияСервер.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МассивТЧ = Новый Массив();
	МассивТЧ.Добавить(РаботникиОрганизации);
	КраткийСоставДокумента = удуДокументыКадровогоУчета.ЗаполнитьКраткийСоставДокумента(МассивТЧ);
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.удуКадровыеПриказыОрганизации.Добавить();
		ЗаписьРегистрации.Период		= Дата;
		ЗаписьРегистрации.Регистратор	= Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ТипЗнч(ДанныеЗаполнения)=Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
		|	СотрудникиОрганизаций.Физлицо,
		|	СотрудникиОрганизаций.Организация,
		|	СотрудникиОрганизаций.ВидДоговора
		|ИЗ
		|	Справочник.удуСотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка В (&Сотрудники)";
		Запрос.УстановитьПараметр("Сотрудники",	ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЭтотОбъект.Организация = Выборка.Организация;
		Выборка.Сбросить();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидДоговора = Перечисления.удуВидыДоговоровСФизЛицами.Подряда Тогда
				Возврат;
			КонецЕсли;
			
			НоваяСтрока = ЭтотОбъект.РаботникиОрганизации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ДатаУвольнения				= ТекущаяДата();
		КонецЦикла;	
		
КонецПроцедуры
